Repository: NaN-tic/trytond-carrier_send_shipments
Catalog: locale/*.po
Languages: ca, ca_es, es, es_es

# error:carrier.manifest:
source: Not available manifest "%s" carrier.
ca_es: Manifest "%s" de transportista no disponible.
es_es: Manifiesto "%s" de transportista no disponible.

# error:carrier.print.shipment:
source: The carrier "%(carrier)s" has not any API method available.
ca_es: El transportista "%(carrier)s" no té disponible cap API.
es_es: El transportista "%(carrier)s" no tiene ninguna API disponible.

# error:carrier.print.shipment:
source: The shipment "%(shipment)s" has not any carrier assigned. Please, select one carrier before trying to print the label.
ca_es: L'enviament "%(shipment)s" no té cap transportista assignat. Si us plau, seleccioneu un transportista abans d'intentar imprimir l'etiqueta.
es_es: El envío "%(shipment)s" no tiene ningún transportista asignado. Por favor, seleccione uno antes de intentar imprimir la etiqueta.

# error:carrier.print.shipment:
source: The shipment %(shipment)s is not in any of these states "%(state)s".
ca_es: L'enviament %(shipment)s no està en cap d'aquests estats "%(state)s".
es_es: El envío %(shipment)s no está en ninguno de estos estados "%(state)s".

# error:carrier.print.shipment:
source: The shipment (%(shipment)s) is already sent.
ca_es: L'enviament (%(shipment)s) ja s'ha enviat.
es_es: El envío (%(shipment)s) ya está enviado.

# error:carrier.print.shipment:
source: The zip "%(zip)s" of the shipment "%(shipment)s" is not available for this carrier.
ca_es: El codi postal "%(zip)s" de l'enviament "%(shipment)s" no està disponible per aquest transportista.
es_es: El código postal "%(zip)s" del envío "%(shipment)s" no está disponible para este transpostista.

# error:carrier.print.shipment:
source: You've selected shipments with different methods of shipping. Please, select shipments of a unique carrier.
ca_es: Heu seleccionat enviaments amb diferents mètodes d'enviament. Si us plau, seleccioneu enviaments d'un únic transportista.
es_es: Ha seleccionado envíos con diferentes métodos. Por favor, seleccione envíos de un único transportista.

# error:carrier.send.shipments:
source: Not available method API in carrier "%(carrier)s"
ca_es: No es troba el mètode del transportista "%(carrier)s"
es_es: No se encuentra el método API del transportista "%(carrier)s"

# error:carrier.send.shipments:
source: Select a carrier in shipment "%(shipment)s"
ca_es: Selecciona un transportista per l'enviament "%(shipment)s"
es_es: Selecciona en los albaranes un transportista para enviar "%(shipment)s"

# error:carrier.send.shipments:
source: Shipment "%(code)s" not available to send zip "%(zip)s"
ca_es: Enviament "%(code)s" no es pot enviar aquest codi postal "%(zip)s"
es_es: El envío "%(code)s" no se puede enviar a este código postal "%(zip)s"

# error:carrier.send.shipments:
source: Shipment %(code)s not have address details: street, zip, city or country.
es_es: El albarán %(code)s no dispone en la dirección: calle, código postal, ciudad o país.

# error:carrier.send.shipments:
source: Shipment (%(shipment)s) was sended
ca_es: L'albarà (%(shipment)s) ja s'havia enviat en un altre moment
es_es: El envío (%(shipment)s) ya se ha enviado anteriormente

# error:carrier.send.shipments:
source: Shipment ID (%(shipment)s) not state "%(state)s"
ca_es: L'albarà ID (%(shipment)s) no es troba en els estats "%(state)s"
es_es: El envío ID (%(shipment)s) no se encuentra en el estado del albarán "%(state)s"

# error:carrier.send.shipments:
source: Successfully: %(references)s Errors: %(errors)s
ca_es: Amb éxit: %(references)s Errors: %(errors)s
es_es: Con éxito: %(references)s Errors: %(errors)s

# error:carrier.send.shipments:
source: You select different shipments to send %(methods)s. Select shipment grouped by carrier
ca_es: Has seleccionat varis albarans per diferents mètodes %(methods)s. Agrupa els albarans per transportista
es_es: Ha seleccionado diferentes tipos de envío %(methods)s. Selecciona los albaranes por transportista.

# field:carrier.get.label.result,attachments:
source: Attachments
ca: Adjunts
ca_es: Adjunts
es: Adjuntos
es_es: Adjuntos

# field:carrier.get.label.start,codes:
source: Codes
ca: Codis
ca_es: Codis
es: Códigos
es_es: Códigos

# field:carrier.manifest.start,carrier_api:
source: Carrier API
ca: API transportista
ca_es: API transportista
es: API transportista
es_es: API transportista

# field:carrier.manifest.start,from_date:
source: From Date
ca: Desde la data
ca_es: Data inicial
es: Desde la fecha
es_es: Fecha inicial

# field:carrier.manifest.start,to_date:
source: To Date
ca: A la data
ca_es: Data final
es: A la fecha
es_es: Fecha final

# field:carrier.print.shipment.result,file_name:
source: File Name
ca: Nom del fitxer
ca_es: Nom de fitxer
es: Nombre fichero
es_es: Nombre de fichero

# field:carrier.print.shipment.result,labels:
source: Labels
ca: Etiquetes
ca_es: Etiquetes
es: Etiquetas
es_es: Etiquetas

# field:carrier.print.shipment.start,shipments:
source: Shipments
ca: Albarans
ca_es: Enviaments
es: Albaranes
es_es: Envíos

# field:carrier.result.manifest,file_name:
source: File Name
ca: Nom del fitxer
ca_es: Nom de fitxer
es: Nombre fichero
es_es: Nombre de fichero

# field:carrier.result.manifest,manifest:
source: Manifest
es: Manifiesto
es_es: Manifiesto

# field:carrier.send.shipments.result,file_name:
source: File Name
ca: Nom del fitxer
ca_es: Nom de fitxer
es: Nombre fichero
es_es: Nombre de fichero

# field:carrier.send.shipments.result,labels:
source: Labels
ca: Etiquetes
ca_es: Etiquetes
es: Etiquetas
es_es: Etiquetas

# field:carrier.send.shipments.start,shipments:
source: Shipments
ca: Albarans
ca_es: Enviaments
es: Albaranes
es_es: Envíos

# field:stock.configuration,attach_label:
source: Attach Label
ca: Etiqueta adjunt
ca_es: Adjunta etiqueta
es: Adjuntar etiqueta
es_es: Adjuntar etiqueta

# field:stock.shipment.out,carrier_cashondelivery:
source: Carrier Cash OnDelivery
ca_es: Contrareemborsament
es_es: Contrarembolso

# field:stock.shipment.out,carrier_cashondelivery_total:
source: Carrier Cash OnDelivery Total
ca_es: Total contrareemborsament
es_es: Total contrarembolso

# field:stock.shipment.out,carrier_delivery:
source: Delivered
ca: Entregat
ca_es: Enviat
es: Entregado
es_es: Enviado

# field:stock.shipment.out,carrier_notes:
source: Carrier Notes
ca: Notes transportista
ca_es: Notes transportista
es: Notas transportistas
es_es: Notas transportista

# field:stock.shipment.out,carrier_price_total:
source: Price Total
ca_es: Preu total
es_es: Precio total

# field:stock.shipment.out,carrier_printed:
source: Printed
ca: Imprès
ca_es: Imprimit
es: Imprimido
es_es: Imprimido

# field:stock.shipment.out,carrier_send_date:
source: Carrier Send Date
ca: Data enviament transportista
ca_es: Data enviament transportista
es: Fecha envío transportista
es_es: Fecha envío transportista

# field:stock.shipment.out,carrier_send_employee:
source: Carrier Send Employee
ca: Empleat enviament transportista
ca_es: Empleat enviament transportista
es: Empleado envío transportista
es_es: Empleado envío transportista

# field:stock.shipment.out,carrier_service:
source: Carrier API Service
ca: Servei API transportista
ca_es: Servei transportista
es: Servicio API transportista
es_es: Servicio transportista

# field:stock.shipment.out,carrier_service_domain:
source: Carrier Domain
ca: Domini transportista
ca_es: Domini transportista
es: Dominio transportista
es_es: Dominio transportista

# help:carrier.get.label.start,codes:
source: Introduce codes or tracking reference of shipments separated by commas.
ca: Introdueix el codi o referencia tracking dels albarans separat per comes.
ca_es: Introduïu codis o referencies d'enviaments separats per comes.
es: Introducir códigos o referencia tracking del albarán separados por comas.
es_es: Introduzca códigos o referencias de envíos separados por comas.

# help:stock.shipment.out,carrier_delivery:
source: The package has been delivered
ca: El paquet s'ha enviat
ca_es: El paquet ja s'ha enviat
es: El paquete no se ha enviado.
es_es: El paquete ha sido enviado

# help:stock.shipment.out,carrier_notes:
source: Notes to add carrier
ca_es: Notes per afegir al transpostista.
es_es: Notas para añadir al transportista

# help:stock.shipment.out,carrier_printed:
source: Picking is already printed
ca: El albarà ja s'ha imprès
ca_es: L'albarà ja està imprimit.
es: El albarán ya se ha imprimido
es_es: El albarán ya está imprimido.

# model:carrier.get.label.result,name:
source: Carrier Get Label Result
ca: Resultat etiqueta transportista
ca_es: Resultat d'obtenció d'etiquetes de transportista
es: Resultado etiqueta transportista
es_es: Resultado de obtención de etiquetas de transportista

# model:carrier.get.label.start,name:
source: Carrier Get Label Start
ca: Inici etiqueta transportista
ca_es: Inici d'obtenció d'etiquetes de transportista
es: Inicio etiqueta transportista
es_es: Inicio de obtención de etiquetas de transportista

# model:carrier.manifest.start,name:
source: Carrier Manifest Start
ca: Inici manifest transportista
ca_es: Inici manifest transportista
es: Inicio manifiesto transportista
es_es: Inicio manifiesto

# model:carrier.print.shipment.result,name:
source: Carrier Print Shipment Result
ca: Resultat impressió transportista
ca_es: Resultat d'impressió d'albarà de transportista
es: Resultado impressión transportista
es_es: Resultado impresión albarán transportista

# model:carrier.print.shipment.start,name:
source: Carrier Print Shipment Start
ca: Inici impressió transportista
ca_es: Inici d'impressió d'albarà de transportista
es: Inicio impressión transportista
es_es: Inicio impresión albarán transportista

# model:carrier.result.manifest,name:
source: Carrier Enter Manifest
ca: Manifest transportista
ca_es: Entrada de manifest de transportista
es: Manifiesto transportista
es_es: Manifiesto de entrada del transportista

# model:carrier.send.shipments.result,name:
source: Carrier Send Shipments Result
ca: Resultat enviament transportista
ca_es: Resultat enviament albarà a transportista
es: Resultado envío transportista
es_es: Resultado envío albaranes a mensajero

# model:carrier.send.shipments.start,name:
source: Carrier Send Shipments Start
ca: Inici enviament transportista
ca_es: Inici enviament albarà a transportista
es: Inicio envío transportista
es_es: Inicio envío albaranes a mensajero

# model:ir.action,name:act_carrier_manifest
source: Manifest
es: Manifiesto
es_es: Manifiesto

# model:ir.action,name:wizard_carrier_get_label
source: Get Labels
ca: Obtenir etiquetes
ca_es: Obté etiquetes
es: Obtener etiquetas
es_es: Obtener etiquetas

# model:ir.action,name:wizard_carrier_print_shipment
source: Label API Carrier
ca: Etiqueta API transportista
ca_es: Etiqueta de la API del transportista
es: Carrier API etiqueta
es_es: Imprimir etiquetas del transportista

# model:ir.action,name:wizard_carrier_send_shipments
source: Send API Carrier
ca: Enviar API transportista
ca_es: Envia a un transportista
es: Enviar API transportista
es_es: Enviar a un transportista

# model:ir.ui.menu,name:get_carrier_labels
source: Carrier Labels
ca: Etiquetes transportista
ca_es: Etiquetes de transportista
es: Etiquetas transportista
es_es: Etiquetas de transportista

# model:ir.ui.menu,name:menu_carrier_manifest
source: Manifest
es: Manifiesto
es_es: Manifiesto

# view:carrier.get.label.result:
source: Print Shipment
ca_es: Impressió d'enviament
es_es: Imprimir albarán

# view:carrier.get.label.result:
source: There are no labels to show.
ca_es: No hi han etiquetes per mostrar.
es_es: No hay etiquetas que mostrar.

# view:carrier.get.label.start:
source: Get labels from carrier
ca_es: Obté etiquetes de transportista
es_es: Obtener etiquetas de transportista

# view:carrier.manifest.start:
source: Manifest
es_es: Manifiesto

# view:carrier.print.shipment.result:
source: Print Shipment
ca_es: Impressió d'enviament
es_es: Imprimir albarán

# view:carrier.print.shipment.start:
source: Download a shipment label (PDF) from API carrier (when API carrier available download option)
ca: Descarrega una etiqueta de l'albarà (PDF) de l'API del transportista (quan estigui disponible l'API transportista)
ca_es: Descarrega una etiqueta d'enviament (PDF) des de l'API del transportista (quan la opció de descàrrega des de l'API està disponible)
es: Descarga una etiqueta del albarán (PDF) de la API del transportista (cuando API del transportista dispone de esta opción)
es_es: Descarga una entiqueta de envío (PDF) desde la API del transportista (cuando la opción de descarga de la API del transportista está disponible).

# view:carrier.print.shipment.start:
source: Print Shipment
ca_es: Impressió d'enviament
es_es: Imprimir albarán

# view:carrier.print.shipment.start:
source: Print label from carrier
ca: Imprimir etiqueta del transportista
ca_es: Imprimeix etiqueta del transportista
es: Imprimir albaran al transportista
es_es: Imprime etiqueta del transportista

# view:carrier.result.manifest:
source: Manifest
es_es: Manifiesto

# view:carrier.send.shipments.result:
source: Labels
ca: Etiquetes
ca_es: Etiquetes
es: Etiquetas
es_es: Etiquetas

# view:carrier.send.shipments.result:
source: Send Shipment
ca_es: Envia albarà
es_es: Enviar albarán

# view:carrier.send.shipments.start:
source: Send Shipment
ca_es: Envia albarà
es_es: Enviar albarán

# view:carrier.send.shipments.start:
source: Send shipments in state package or done, related a carrier and not deliveried
ca: Enviar albarans amb l'estat del paquest o finalitzat, segons el transportista i no entregat
ca_es: Envia albarà en estat empaquetat o realitzat, relacionat amb un transportista i no entregat.
es: Enviar el albarán en el estado del paquete o finalizado, relacionado con el transportista y todavía no enviado
es_es: Envía albaranes en estado empaquetado o realizado, relacionado con un transportista y no entregado

# view:carrier.send.shipments.start:
source: Send shipments to carrier
ca: Enviar albarà al transportista
ca_es: Envia albarà al transportista
es: Enviar albaraners transportista
es_es: Envía albaranes al transportista

# view:stock.shipment.out:
source: Print Shipment
ca_es: Impressió d'enviament
es_es: Imprimir albarán

# view:stock.shipment.out:
source: Send API Carrier
ca_es: Envia a la API del transportista
es_es: Enviar a la API del transportista

# view:stock.shipment.out:
source: Send Shipment
ca_es: Envia albarà
es_es: Enviar albarán

# wizard_button:carrier.get.label,result,end:
source: Close
ca: Tanca
ca_es: Tanca
es: Cerrar
es_es: Cerrar

# wizard_button:carrier.get.label,start,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# wizard_button:carrier.get.label,start,get:
source: Get
ca: Obtenir
ca_es: Obté
es: Obtener
es_es: Obtener

# wizard_button:carrier.manifest,result,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# wizard_button:carrier.manifest,start,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# wizard_button:carrier.manifest,start,manifest:
source: Get Manifest
ca: Obtenir manifest
ca_es: Descarrega manifest
es: Obtener Manifiesto
es_es: Descargar Manifiesto

# wizard_button:carrier.print.shipment,result,end:
source: Close
ca: Tanca
ca_es: Tanca
es: Cerrar
es_es: Cerrar

# wizard_button:carrier.print.shipment,start,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# wizard_button:carrier.print.shipment,start,print_:
source: Print
ca: Imprimir
ca_es: Imprimeix
es: Imprimir
es_es: Imprimir

# wizard_button:carrier.send.shipments,result,end:
source: Close
ca: Tanca
ca_es: Tanca
es: Cerrar
es_es: Cerrar

# wizard_button:carrier.send.shipments,start,end:
source: Cancel
ca: Cancel·la
ca_es: Cancel·la
es: Cancelar
es_es: Cancelar

# wizard_button:carrier.send.shipments,start,send:
source: Send
ca: Enviar
ca_es: Envia
es: Enviar
es_es: Enviar

# error:stock.shipment.out:
source: Carrier "%(name)s" not have API
ca_es: El transportista "%(name)s" no disposa de API.

# error:stock.shipment.out:
source: Shipment "%(name)s" not have address details: street, zip, city or country.
ca_es: L'adreça d'enviament de l'albarà "%(name)s" no conté els camps: adreça, codi postal o pais.

# field:stock.shipment.out,carrier_sale_price_total:
source: Price Total
ca_es: Venda total

# view:carrier.result.manifest:
source: API carrier return a empty file. Try again or contact to carrier suport.
ca_es: El fitxer del servei web de la API del trasnportista es troba buit. Torni a intentar o contacti amb el centre de suport del transportista.

# field:stock.shipment.out,carrier_weight:
source: Carrier Weight
ca: Pes transportista
es: Peso transportista

# field:stock.shipment.out,carrier_weight_uom:
source: Carrier Weight UOM
ca: UOM pes transportista
es: Peso transportista UOM

# field:stock.shipment.out,mobile:
source: Mobile
ca: Mòbil
es: Móbil

# field:stock.shipment.out,phone:
source: Phone
ca: Telèfon
es: Teléfono

# help:stock.shipment.out,carrier_notes:
source: Add notes when send API shipment
ca: Afegir notes quan s'envia l'albarà
es: Añadir notas cuando se envía a la API

# model:ir.action,name:report_label
source: Carrier Labels
ca: Etiqueta transportista
es: Etiquetas transportista

# model:ir.message,text:msg_add_carrier
source: Select a carrier in shipment "%(shipment)s"
ca: Selecciona un transportista a l'albarà "%(shipment)s"
es: Selecciona el transportista en el albarán "%(shipment)s"

# model:ir.message,text:msg_date_format_error
source: Error building domain of type Date. Please, check the format: Field: %(field)s Value: %(value)s Format: %%d/%%m/%%Y
ca: Error de domini pel tipus Date. Revisi que és una data. Camp: %(field)s Valor: %(value)s Format: %%d/%%m/%%Y
es: Error construeindo el dominio del tipo Date. Compruebe el formato: Campo: %(field)s Valor: %(value)s Formato: %%d/%%m/%%Y

# model:ir.message,text:msg_datetime_format_error
source: Error building domain of type DateTime or Timestamp. Please, check the format: Field: %(field)s Value: %(value)s Format: %%d/%%m/%%Y %%H:%%M:%%S
ca: Error de domini pel tipus DateTime o Timestamp. Revisi que el format. Camp: %(field)s Valor: %(value)s Format: %%d/%%m/%%Y %%H:%%M:%%S
es: Error construeindo el dominio del tipo DateTime o Timestamp. Compruebe el formato: Campo: %(field)s Valor: %(value)s Format: %%d/%%m/%%Y %%H:%%M:%%S

# model:ir.message,text:msg_domain_field_error
source: Error in field domain: %(domain)s
ca: Error en el domini del camp: %(domain)s
es: Error en el dominio del campo: %(domain)s

# model:ir.message,text:msg_domain_field_help
source: This field must returns a variable called "domain" with a Tryton domain.
ca: Aquest camp retorna a variable anomenada "domain" amb un domini de Tryton.
es: El campo devuelve una variable llamada "domain" con un dominio de Tryton.

# model:ir.message,text:msg_not_carrier
source: Shipment "%(name)s" not have carrier
es: El albarán "%(name)s" no dispone de transportista

# model:ir.message,text:msg_not_carrier_api
source: Carrier "%(name)s" not have API
ca: El transportista "%(name)s" no dispossa de API.
es: El transportista "%(name)s" no dispone de API

# model:ir.message,text:msg_not_implemented_error
source: Error. Field of type %(field)s is not implemented yet.
ca: Error. El tipus de camp %(field)s no està implementat.
es: Error. El tipo de campo %(field)s no se ha implementado.

# model:ir.message,text:msg_number_format_error
source: Error building domain of type Float. Please, ensure you have put a number. Field: %(field)s Value: %(value)s
ca: Error de domini pel tipus Float. Revisi que és un número. Camp: %(field)s Valor: %(value)s
es: Error construeindo el dominio del tipo Float. Compruebe el formato: Campo: %(field)s Valor: %(value)s

# model:ir.message,text:msg_several_shipments
source: Cannot print carrier labels for more than one shipment at once.
ca: No pot imprimir etiquetes quan selecciona més d'un albarà.
es: No puede imprimir etiquetas cuando han seleccionado más de un albarán.

# model:ir.message,text:msg_shipment_info
source: Successfully: %(references)s Errors: %(errors)s
ca: Enviats correctament: %(references)s Errors: %(errors)s
es: Enviados correctamente: %(references)s Errores: %(errors)s

# model:ir.message,text:msg_shipment_not_tracking_ref
source: The is not a carrier tracking reference in shipment "%(shipment)s".
ca: No hi ha una referència de tracking per l'albarà "%(shipment)s".
es: No hay una referencia de tracking en el albarán "%(shipment)s".

# model:ir.message,text:msg_shipment_sended
source: Shipment "%(shipment)s" was sended. Can not delivery again.
ca: L'albarà "%(shipment)s" s'ha enviat. Ja no el pot tornar a enviar.
es: El albarán "%(shipment)s" se ha enviado. No se puede enviar otra vez.

# model:ir.message,text:msg_shipment_zip
source: Not available "%(shipment)s" to delivery at zip: "%(zip)s"
ca: No està disponible l'albarà"%(shipment)s" per entregar al codi postal: "%(zip)s"
es: No se puede enviar el albarán "%(shipment)s" al código postal: "%(zip)s"

# model:ir.message,text:msg_shipmnet_delivery_address
source: Shipment "%(name)s" not have address details: street, zip, city or country.
ca: L'albarà "%(name)s" no dispossa a l'adreça: carrer, codi postal, ciutat o país.
es: El albarán "%(name)s" no dispone a la direccion: calle, código postal, ciudad o país.

# model:ir.model.button,string:wizard_carrier_print_shipment_button
source: Print API Carrier
ca: Imprimir API transportista
es: Impresión API transportista

# model:ir.model.button,string:wizard_carrier_send_shipments_button
source: Send API Carrier
ca: Enviar API transportista
es: Enviar API transportista
